data/collected_data/orange/api/standarda8v2/f/load_read.txt
Running 30m test @ http://20.117.66.220:60/wrk2-api/home-timeline/read
  2 threads and 1000 connections
  Thread calibration: mean lat.: 792.476ms, rate sampling interval: 3975ms
  Thread calibration: mean lat.: 762.629ms, rate sampling interval: 3657ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    11.34m     6.68m   22.84m    57.73%
    Req/Sec   115.51     10.99   145.00     82.94%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.35m 
 75.000%   17.10m 
 90.000%   20.62m 
 99.000%   22.84m 
 99.900%   23.47m 
 99.990%   23.84m 
 99.999%   23.99m 
100.000%   24.13m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     421.887     0.000000            1         1.00
  124911.615     0.100000        41526         1.11
  262537.215     0.200000        83060         1.25
  401604.607     0.300000       124562         1.43
  541589.503     0.400000       166123         1.67
  681050.111     0.500000       207685         2.00
  748683.263     0.550000       228374         2.22
  818413.567     0.600000       249158         2.50
  886571.007     0.650000       269833         2.86
  956301.311     0.700000       290587         3.33
 1026031.615     0.750000       311394         4.00
 1061158.911     0.775000       321806         4.44
 1096810.495     0.800000       332280         5.00
 1132462.079     0.825000       342651         5.71
 1167065.087     0.850000       352905         6.67
 1201668.095     0.875000       363215         8.00
 1219493.887     0.887500       368511         8.89
 1237319.679     0.900000       373884        10.00
 1255145.471     0.912500       379002        11.43
 1272971.263     0.925000       384107        13.33
 1290797.055     0.937500       389394        16.00
 1299185.663     0.943750       391925        17.78
 1307574.271     0.950000       394424        20.00
 1317011.455     0.956250       397225        22.86
 1325400.063     0.962500       399746        26.67
 1333788.671     0.968750       402197        32.00
 1339031.551     0.971875       403618        35.56
 1343225.855     0.975000       404749        40.00
 1348468.735     0.978125       406060        45.71
 1354760.191     0.981250       407555        53.33
 1358954.495     0.984375       408618        64.00
 1362100.223     0.985938       409354        71.11
 1365245.951     0.987500       410005        80.00
 1368391.679     0.989062       410647        91.43
 1372585.983     0.990625       411331       106.67
 1375731.711     0.992188       411904       128.00
 1377828.863     0.992969       412187       142.22
 1380974.591     0.993750       412587       160.00
 1383071.743     0.994531       412855       182.86
 1386217.471     0.995313       413166       213.33
 1389363.199     0.996094       413515       256.00
 1391460.351     0.996484       413697       284.44
 1393557.503     0.996875       413850       320.00
 1395654.655     0.997266       414010       365.71
 1397751.807     0.997656       414177       426.67
 1399848.959     0.998047       414297       512.00
 1401946.111     0.998242       414400       568.89
 1402994.687     0.998437       414449       640.00
 1405091.839     0.998633       414544       731.43
 1407188.991     0.998828       414645       853.33
 1408237.567     0.999023       414689      1024.00
 1409286.143     0.999121       414730      1137.78
 1411383.295     0.999219       414787      1280.00
 1412431.871     0.999316       414826      1462.86
 1413480.447     0.999414       414851      1706.67
 1414529.023     0.999512       414893      2048.00
 1415577.599     0.999561       414923      2275.56
 1416626.175     0.999609       414937      2560.00
 1417674.751     0.999658       414954      2925.71
 1419771.903     0.999707       414970      3413.33
 1421869.055     0.999756       414989      4096.00
 1422917.631     0.999780       415003      4551.11
 1423966.207     0.999805       415012      5120.00
 1425014.783     0.999829       415018      5851.43
 1427111.935     0.999854       415033      6826.67
 1428160.511     0.999878       415039      8192.00
 1429209.087     0.999890       415044      9102.22
 1430257.663     0.999902       415053     10240.00
 1430257.663     0.999915       415053     11702.86
 1431306.239     0.999927       415062     13653.33
 1431306.239     0.999939       415062     16384.00
 1433403.391     0.999945       415066     18204.44
 1434451.967     0.999951       415072     20480.00
 1434451.967     0.999957       415072     23405.71
 1434451.967     0.999963       415072     27306.67
 1438646.271     0.999969       415080     32768.00
 1438646.271     0.999973       415080     36408.89
 1438646.271     0.999976       415080     40960.00
 1438646.271     0.999979       415080     46811.43
 1438646.271     0.999982       415080     54613.33
 1439694.847     0.999985       415083     65536.00
 1439694.847     0.999986       415083     72817.78
 1439694.847     0.999988       415083     81920.00
 1439694.847     0.999989       415083     93622.86
 1441791.999     0.999991       415084    109226.67
 1441791.999     0.999992       415084    131072.00
 1442840.575     0.999993       415085    145635.56
 1442840.575     0.999994       415085    163840.00
 1442840.575     0.999995       415085    187245.71
 1448083.455     0.999995       415087    218453.33
 1448083.455     1.000000       415087          inf
#[Mean    =   680497.174, StdDeviation   =   401049.274]
#[Max     =  1447034.880, Total count    =       415087]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  421806 requests in 30.00m, 5.58GB read
  Socket errors: connect 0, read 6159, write 11265, timeout 121730
  Non-2xx or 3xx responses: 109
Requests/sec:    234.33
Transfer/sec:      3.17MB